Subiksha-A/QNX_India_Hackathon_CHN_2026_019/src/ecu/mcxa156/frdm_mcxa156_sensor_node.c
/*
 * FRDM-MCXA156 CAN Sensor Node
 * -----------------------------------------
 * CAN telemetry + QNX command receiver
 * Ultrasonic sensor
 * IR obstacle sensor
 *
 * CAN:
 *   RX = P1_12
 *   TX = P1_13
 *
 * Ultrasonic:
 *   TRIG = P3_27
 *   ECHO = P3_28
 *
 * IR:
 *   OUT = P1_14
 *
 * Compatible with Raspberry Pi QNX gateway.
 */

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include "fsl_debug_console.h"
#include "fsl_flexcan.h"
#include "fsl_gpio.h"

#include "board.h"
#include "app.h"


/*******************************************************************************
 * Configuration
 ******************************************************************************/

/* Logging */
#define LOG_INFO(x)                 (void)PRINTF x

/*
 * Node configuration
 *
 * Node 1:
 *   0x111 Temperature
 *   0x112 Humidity
 *   0x113 Speed
 *   0x114 Battery voltage
 *   0x115 Battery current
 *   0x116 Ultrasonic
 *   0x117 IR
 *
 * Node 2:
 *   0x121 - 0x125
 */
#define THIS_NODE_ID                1


/* CAN message buffers */
#define TX_MB_NUM                   (0)
#define RX_MB_NUM                   (1)


/*******************************************************************************
 * CAN IDs
 ******************************************************************************/

#if (THIS_NODE_ID == 1)

#define CAN_ID_TEMPERATURE          0x111U
#define CAN_ID_HUMIDITY             0x112U
#define CAN_ID_SPEED                0x113U
#define CAN_ID_BATTERY_VOLTAGE      0x114U
#define CAN_ID_BATTERY_CURRENT      0x115U

#define CAN_ID_NODE_CMD             0x201U

#else

#define CAN_ID_TEMPERATURE          0x121U
#define CAN_ID_HUMIDITY             0x122U
#define CAN_ID_SPEED                0x123U
#define CAN_ID_BATTERY_VOLTAGE      0x124U
#define CAN_ID_BATTERY_CURRENT      0x125U

#define CAN_ID_NODE_CMD             0x202U

#endif


/* Broadcast command */
#define CAN_ID_BROADCAST_CMD        0x200U


/*******************************************************************************
 * Sensor Types
 ******************************************************************************/

#define SENSOR_TYPE_TEMPERATURE     0x01U
#define SENSOR_TYPE_HUMIDITY        0x02U
#define SENSOR_TYPE_SPEED           0x03U
#define SENSOR_TYPE_BATTERY_VOLTAGE 0x04U
#define SENSOR_TYPE_BATTERY_CURRENT 0x05U

/* Ultrasonic */
#define SENSOR_TYPE_ULTRASONIC     0x06U
#define CAN_ID_ULTRASONIC           0x116U

/* IR obstacle sensor */
#define SENSOR_TYPE_IR              0x07U
#define CAN_ID_IR                   0x117U


/*******************************************************************************
 * Ultrasonic Pin Configuration
 ******************************************************************************/

/*
 * HC-SR04 style sensor
 *
 * TRIG -> P3_27
 * ECHO -> P3_28
 */

#define ULTRASONIC_TRIG_PORT        GPIO3
#define ULTRASONIC_TRIG_PIN         27U

#define ULTRASONIC_ECHO_PORT        GPIO3
#define ULTRASONIC_ECHO_PIN         28U

#define ULTRASONIC_TIMEOUT_US       30000U


/*******************************************************************************
 * IR Pin Configuration
 ******************************************************************************/

/*
 * IR obstacle sensor
 *
 * VCC -> 3.3V
 * GND -> GND
 * OUT -> P1_14
 */

#define IR_PORT                     GPIO1
#define IR_PIN                      14U


/*******************************************************************************
 * General CAN Configuration
 ******************************************************************************/

#define CAN_DLC                     8U

/* Sensor transmission interval */
#define SENSOR_INTERVAL_MS          500U


/*******************************************************************************
 * Global Variables
 ******************************************************************************/

static flexcan_frame_t txFrame;
static flexcan_frame_t rxFrame;

/*
 * Sensor streaming state.
 *
 * true  = sensors active
 * false = sensors paused
 *
 * QNX can control this using:
 *
 * 0x01 -> START
 * 0x00 -> STOP
 */
static volatile bool g_sensorActive = true;


/*******************************************************************************
 * Simulated / Built-in Sensors
 ******************************************************************************/

/*
 * Onboard temperature sensor.
 *
 * This retains the behavior from your original program.
 */
static float ReadBuiltInTemperature(void)
{
    static float currentTemp = 24.80f;
    static int dir = 1;

    currentTemp += (dir * 0.05f);

    if (currentTemp > 28.20f)
    {
        dir = -1;
    }

    if (currentTemp < 24.80f)
    {
        dir = 1;
    }

    return currentTemp;
}


/*
 * Humidity
 */
static float ReadHumidity(void)
{
    static float humidity =
        (THIS_NODE_ID == 1) ? 54.0f : 58.5f;

    humidity += 0.1f;

    if (humidity > 70.0f)
    {
        humidity = 50.0f;
    }

    return humidity;
}


/*
 * Speed
 */
static float ReadSpeed(void)
{
    static float speed =
        (THIS_NODE_ID == 1) ? 35.0f : 42.0f;

    speed += 0.25f;

    if (speed > 80.0f)
    {
        speed = 30.0f;
    }

    return speed;
}


/*
 * Battery voltage
 */
static float ReadBatteryVoltage(void)
{
    return (THIS_NODE_ID == 1) ? 48.40f : 47.90f;
}


/*
 * Battery current
 */
static float ReadBatteryCurrent(void)
{
    return (THIS_NODE_ID == 1) ? 12.10f : 10.45f;
}


/*******************************************************************************
 * Ultrasonic Sensor
 ******************************************************************************/

/*
 * Initialize ultrasonic sensor GPIO.
 */
static void Ultrasonic_Init(void)
{
    gpio_pin_config_t trigConfig =
    {
        kGPIO_DigitalOutput,
        0U
    };

    gpio_pin_config_t echoConfig =
    {
        kGPIO_DigitalInput,
        0U
    };

