Subiksha-A/QNX_India_Hackathon_CHN_2026_019/src/ecu/mcxa156/frdm_mcxa156_sensor_node.c
    GPIO_PinInit(
        ULTRASONIC_TRIG_PORT,
        ULTRASONIC_TRIG_PIN,
        &trigConfig
    );

    GPIO_PinInit(
        ULTRASONIC_ECHO_PORT,
        ULTRASONIC_ECHO_PIN,
        &echoConfig
    );

    GPIO_PinWrite(
        ULTRASONIC_TRIG_PORT,
        ULTRASONIC_TRIG_PIN,
        0U
    );
}


/*
 * Initialize DWT cycle counter.
 *
 * Used for microsecond timing.
 */
static void Ultrasonic_TimerInit(void)
{
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;

    DWT->CYCCNT = 0U;

    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}


/*
 * Get elapsed microseconds from DWT counter.
 */
static uint32_t Ultrasonic_GetUs(void)
{
    uint32_t cyclesPerUs;

    cyclesPerUs =
        SystemCoreClock / 1000000U;

    if (cyclesPerUs == 0U)
    {
        cyclesPerUs = 1U;
    }

    return DWT->CYCCNT / cyclesPerUs;
}


/*
 * Read HC-SR04 distance.
 *
 * Distance in cm:
 *
 *     distance = echo_time_us / 58
 *
 * Returns:
 *
 *     > 0  = valid distance
 *     0    = timeout
 */
static float ReadUltrasonicDistance(void)
{
    uint32_t startUs;
    uint32_t echoTimeUs;


    /* Make sure TRIG starts LOW */
    GPIO_PinWrite(
        ULTRASONIC_TRIG_PORT,
        ULTRASONIC_TRIG_PIN,
        0U
    );

    SDK_DelayAtLeastUs(
        5U,
        SystemCoreClock
    );


    /* 10 us trigger pulse */
    GPIO_PinWrite(
        ULTRASONIC_TRIG_PORT,
        ULTRASONIC_TRIG_PIN,
        1U
    );

    SDK_DelayAtLeastUs(
        10U,
        SystemCoreClock
    );

    GPIO_PinWrite(
        ULTRASONIC_TRIG_PORT,
        ULTRASONIC_TRIG_PIN,
        0U
    );


    /* Wait for ECHO rising edge */
    startUs = Ultrasonic_GetUs();

    while (
        GPIO_PinRead(
            ULTRASONIC_ECHO_PORT,
            ULTRASONIC_ECHO_PIN
        ) == 0U
    )
    {
        if (
            (Ultrasonic_GetUs() - startUs)
            >= ULTRASONIC_TIMEOUT_US
        )
        {
            return 0.0f;
        }
    }


    /* Measure ECHO HIGH pulse width */
    startUs = Ultrasonic_GetUs();

    while (
        GPIO_PinRead(
            ULTRASONIC_ECHO_PORT,
            ULTRASONIC_ECHO_PIN
        ) != 0U
    )
    {
        if (
            (Ultrasonic_GetUs() - startUs)
            >= ULTRASONIC_TIMEOUT_US
        )
        {
            return 0.0f;
        }
    }


    echoTimeUs =
        Ultrasonic_GetUs() - startUs;


    return ((float)echoTimeUs / 58.0f);
}


/*******************************************************************************
 * IR Sensor
 ******************************************************************************/

/*
 * Initialize IR obstacle sensor.
 *
 * P1_14 = GPIO1[14]
 */
static void IR_Init(void)
{
    gpio_pin_config_t irConfig =
    {
        kGPIO_DigitalInput,
        0U
    };


    GPIO_PinInit(
        IR_PORT,
        IR_PIN,
        &irConfig
    );
}


/*
 * Read raw IR sensor state.
 *
 * Returns:
 *
 *     0 = LOW
 *     1 = HIGH
 */
static uint8_t ReadIRSensor(void)
{
    return GPIO_PinRead(
        IR_PORT,
        IR_PIN
    );
}


/*
 * Convert IR signal to obstacle status.
 *
 * For the common IR obstacle module:
 *
 *     LOW  = obstacle detected
 *     HIGH = no obstacle
 *
 * Returns:
 *
 *     1 = obstacle detected
 *     0 = no obstacle
 */
static uint8_t GetIRObstacleStatus(void)
{
    uint8_t irState;

    irState = ReadIRSensor();

    if (irState == 0U)
    {
        return 1U;
    }

    return 0U;
}


/*******************************************************************************
 * CAN Transmission
 ******************************************************************************/

/*
 * Build standard sensor CAN frame.
 *
 * Payload:
 *
 * Byte 0 = value high byte
 * Byte 1 = value low byte
 * Byte 2 = sensor type
 * Byte 3 = node ID
 * Byte 4 = reserved
 * Byte 5 = reserved
 * Byte 6 = reserved
 * Byte 7 = reserved
 *
 * Value is encoded as value x 100.
 */
static void BuildSensorFrame(
    uint32_t canId,
    uint8_t sensorType,
    float value
)
{
    uint16_t rawValue;


    if (value < 0.0f)
    {
        rawValue = 0U;
    }
    else if (value > 655.35f)
    {
        rawValue = 65535U;
    }
    else
    {
        rawValue =
            (uint16_t)((value * 100.0f) + 0.5f);
    }


    memset(
        &txFrame,
        0,
        sizeof(txFrame)
    );


    txFrame.id =
        FLEXCAN_ID_STD(canId);

    txFrame.format =
        (uint8_t)kFLEXCAN_FrameFormatStandard;

    txFrame.type =
        (uint8_t)kFLEXCAN_FrameTypeData;

    txFrame.length =
        CAN_DLC;


    /* Value x 100, big endian */
    txFrame.dataByte0 =
        (uint8_t)((rawValue >> 8U) & 0xFFU);

    txFrame.dataByte1 =
        (uint8_t)(rawValue & 0xFFU);


    /* Sensor type */
    txFrame.dataByte2 =
        sensorType;


    /* Node ID */
    txFrame.dataByte3 =
        (uint8_t)THIS_NODE_ID;


    /* Reserved */
    txFrame.dataByte4 = 0x00U;
    txFrame.dataByte5 = 0x00U;
    txFrame.dataByte6 = 0x00U;
    txFrame.dataByte7 = 0x00U;
}


/*
 * Send normal sensor CAN frame.
 */
static void SendSensor(
    uint32_t canId,
    uint8_t sensorType,
    float value
)
{
    BuildSensorFrame(
        canId,
        sensorType,
        value
    );


    (void)FLEXCAN_TransferSendBlocking(
        EXAMPLE_CAN,
        TX_MB_NUM,
        &txFrame
    );
}


/*******************************************************************************
 * IR CAN Transmission
 ******************************************************************************/

/*
 * Send IR obstacle status.
 *
 * CAN ID:
 *
 *     0x117
 *
 * Payload:
 *
 * Byte 0:
 *     0 = no obstacle
 *     1 = obstacle detected
 *
 * Byte 1:
 *     reserved
 *
 * Byte 2:
 *     0x07 = IR sensor
 *
 * Byte 3:
 *     Node ID
 *
 * Byte 4-7:
 *     reserved
 */
static void SendIRSensor(uint8_t obstacle)
{
    memset(
        &txFrame,
        0,
        sizeof(txFrame)
    );


