Subiksha-A/QNX_India_Hackathon_CHN_2026_019/src/ecu/mcxa156/frdm_mcxa156_sensor_node.c
    txFrame.id =
        FLEXCAN_ID_STD(CAN_ID_IR);

    txFrame.format =
        (uint8_t)kFLEXCAN_FrameFormatStandard;

    txFrame.type =
        (uint8_t)kFLEXCAN_FrameTypeData;

    txFrame.length =
        CAN_DLC;


    /* IR obstacle status */
    txFrame.dataByte0 =
        obstacle;


    /* Reserved */
    txFrame.dataByte1 =
        0x00U;


    /* Sensor type */
    txFrame.dataByte2 =
        SENSOR_TYPE_IR;


    /* Node ID */
    txFrame.dataByte3 =
        (uint8_t)THIS_NODE_ID;


    /* Reserved */
    txFrame.dataByte4 = 0x00U;
    txFrame.dataByte5 = 0x00U;
    txFrame.dataByte6 = 0x00U;
    txFrame.dataByte7 = 0x00U;


    (void)FLEXCAN_TransferSendBlocking(
        EXAMPLE_CAN,
        TX_MB_NUM,
        &txFrame
    );
}


/*******************************************************************************
 * CAN Receive Message Buffer
 ******************************************************************************/

/*
 * Non-blocking CAN RX message reader.
 */
static status_t ReadRxMbNonBlocking(
    CAN_Type *base,
    uint8_t mbIdx,
    flexcan_frame_t *pRxFrame
)
{
    uint32_t cs_temp;
    uint8_t rx_code;


    cs_temp =
        base->MB[mbIdx].CS;


    rx_code =
        (uint8_t)(
            (cs_temp & CAN_CS_CODE_MASK)
            >> CAN_CS_CODE_SHIFT
        );


    if (
        (0x2U == rx_code) ||
        (0x6U == rx_code)
    )
    {
        pRxFrame->id =
            base->MB[mbIdx].ID &
            (CAN_ID_EXT_MASK | CAN_ID_STD_MASK);


        pRxFrame->format =
            (cs_temp & CAN_CS_IDE_MASK)
            != 0U
            ?
            (uint8_t)kFLEXCAN_FrameFormatExtend
            :
            (uint8_t)kFLEXCAN_FrameFormatStandard;


        pRxFrame->type =
            (cs_temp & CAN_CS_RTR_MASK)
            != 0U
            ?
            (uint8_t)kFLEXCAN_FrameTypeRemote
            :
            (uint8_t)kFLEXCAN_FrameTypeData;


        pRxFrame->length =
            (uint8_t)(
                (cs_temp & CAN_CS_DLC_MASK)
                >> CAN_CS_DLC_SHIFT
            );


        pRxFrame->timestamp =
            (uint16_t)(
                (cs_temp & CAN_CS_TIME_STAMP_MASK)
                >> CAN_CS_TIME_STAMP_SHIFT
            );


        pRxFrame->dataWord0 =
            base->MB[mbIdx].WORD0;

        pRxFrame->dataWord1 =
            base->MB[mbIdx].WORD1;


        /* Reset RX MB ID */
        base->MB[mbIdx].ID =
            FLEXCAN_ID_STD(CAN_ID_NODE_CMD);


        /* Unlock message buffer */
        (void)base->TIMER;


        return kStatus_Success;
    }


    /* Unlock message buffer */
    (void)base->TIMER;


    return kStatus_Fail;
}


/*******************************************************************************
 * QNX Command Receiver
 ******************************************************************************/

/*
 * Checks commands received from Raspberry Pi QNX.
 *
 * Direct command:
 *
 *     0x201 for Node 1
 *     0x202 for Node 2
 *
 * Broadcast:
 *
 *     0x200
 *
 * Byte 0:
 *
 *     0x01 = START
 *     0x00 = STOP
 */
static void CheckIncomingCommands(void)
{
    if (
        0U != FLEXCAN_GetMbStatusFlags(
            EXAMPLE_CAN,
            1U << RX_MB_NUM
        )
    )
    {
        if (
            ReadRxMbNonBlocking(
                EXAMPLE_CAN,
                RX_MB_NUM,
                &rxFrame
            )
            == kStatus_Success
        )
        {
            uint32_t receivedId;

            uint8_t cmd;


            receivedId =
                rxFrame.id >>
                CAN_ID_STD_SHIFT;


            cmd =
                rxFrame.dataByte0;


            if (
                (receivedId == CAN_ID_NODE_CMD) ||
                (receivedId == CAN_ID_BROADCAST_CMD)
            )
            {
                if (cmd == 0x01U)
                {
                    g_sensorActive = true;

                    LOG_INFO((
                        ">>> [CMD RECEIVED] "
                        "START Command from QNX. "
                        "Sensor streaming RESUMED.\r\n"
                    ));
                }
                else if (cmd == 0x00U)
                {
                    g_sensorActive = false;

                    LOG_INFO((
                        ">>> [CMD RECEIVED] "
                        "STOP Command from QNX. "
                        "Sensor streaming PAUSED.\r\n"
                    ));
                }
            }
        }


        /* Clear RX flag */
        FLEXCAN_ClearMbStatusFlags(
            EXAMPLE_CAN,
            1U << RX_MB_NUM
        );
    }
}


/*******************************************************************************
 * Main
 ******************************************************************************/

int main(void)
{
    flexcan_config_t flexcanConfig;

    flexcan_rx_mb_config_t mbConfig;

    uint32_t cycle = 0U;


    /***************************************************************************
     * Board initialization
     ***************************************************************************/

    BOARD_InitHardware();


    /***************************************************************************
     * Ultrasonic initialization
     ***************************************************************************/

    Ultrasonic_TimerInit();

    Ultrasonic_Init();


    /***************************************************************************
     * IR initialization
     ***************************************************************************/

    IR_Init();


    /***************************************************************************
     * Startup messages
     ***************************************************************************/

