Subiksha-A/QNX_India_Hackathon_CHN_2026_019/src/ecu/mcxa156/frdm_mcxa156_sensor_node.c
    LOG_INFO((
        "\r\n"
        "====================================================\r\n"
    ));

    LOG_INFO((
        "   FRDM-MCXA156 CAN NODE %d\r\n",
        THIS_NODE_ID
    ));

    LOG_INFO((
        "   CAN + ULTRASONIC + IR SENSOR\r\n"
    ));

    LOG_INFO((
        "====================================================\r\n"
    ));

    LOG_INFO((
        "Bitrate: 500 kbps\r\n"
    ));

    LOG_INFO((
        "CAN RX: P1_12\r\n"
    ));

    LOG_INFO((
        "CAN TX: P1_13\r\n"
    ));

    LOG_INFO((
        "Ultrasonic: TRIG=P3_27 | ECHO=P3_28 | "
        "CAN ID=0x116\r\n"
    ));

    LOG_INFO((
        "IR Sensor: OUT=P1_14 | CAN ID=0x117\r\n"
    ));

    LOG_INFO((
        "IR logic: LOW = obstacle detected\r\n"
    ));

    LOG_INFO((
        "====================================================\r\n\r\n"
    ));


    /***************************************************************************
     * FlexCAN initialization
     ***************************************************************************/

    FLEXCAN_GetDefaultConfig(
        &flexcanConfig
    );


    flexcanConfig.bitRate =
        500000U;


    flexcanConfig.enableIndividMask =
        true;


#if defined(EXAMPLE_CAN_CLK_SOURCE)

    flexcanConfig.clkSrc =
        EXAMPLE_CAN_CLK_SOURCE;

#endif


    FLEXCAN_Init(
        EXAMPLE_CAN,
        &flexcanConfig,
        EXAMPLE_CAN_CLK_FREQ
    );


    /***************************************************************************
     * TX Message Buffer
     ***************************************************************************/

    FLEXCAN_SetTxMbConfig(
        EXAMPLE_CAN,
        TX_MB_NUM,
        true
    );


    /***************************************************************************
     * RX Message Buffer
     *
     * Accept:
     *
     *     0x200 broadcast
     *     0x201 Node 1
     *     0x202 Node 2
     *
     * Mask:
     *
     *     0x7F0
     ***************************************************************************/

    FLEXCAN_SetRxIndividualMask(
        EXAMPLE_CAN,
        RX_MB_NUM,
        FLEXCAN_RX_MB_STD_MASK(
            0x7F0U,
            0,
            0
        )
    );


    mbConfig.format =
        kFLEXCAN_FrameFormatStandard;


    mbConfig.type =
        kFLEXCAN_FrameTypeData;


    mbConfig.id =
        FLEXCAN_ID_STD(
            CAN_ID_NODE_CMD
        );


    FLEXCAN_SetRxMbConfig(
        EXAMPLE_CAN,
        RX_MB_NUM,
        &mbConfig,
        true
    );


    /***************************************************************************
     * Ready
     ***************************************************************************/

    LOG_INFO((
        "CAN ready. Starting transmission loop...\r\n"
    ));

    LOG_INFO((
        "Ultrasonic: TRIG=P3_27 | ECHO=P3_28 | "
        "CAN ID=0x116\r\n"
    ));

    LOG_INFO((
        "IR: OUT=P1_14 | CAN ID=0x117\r\n\r\n"
    ));


    /***************************************************************************
     * Main loop
     ***************************************************************************/

    while (true)
    {
        /***********************************************************************
         * Check commands from QNX
         ***********************************************************************/

        CheckIncomingCommands();


        /***********************************************************************
         * Sensor streaming active?
         ***********************************************************************/

        if (g_sensorActive)
        {
            float temp;
            float distanceCm;

            float hum;
            float spd;
            float volt;
            float curr;

            uint8_t irObstacle;


            cycle++;


            /*******************************************************************
             * Read existing sensors
             *******************************************************************/

            temp =
                ReadBuiltInTemperature();


            hum =
                ReadHumidity();


            spd =
                ReadSpeed();


            volt =
                ReadBatteryVoltage();


            curr =
                ReadBatteryCurrent();


            /*******************************************************************
             * Transmit existing sensor telemetry
             *******************************************************************/

            SendSensor(
                CAN_ID_TEMPERATURE,
                SENSOR_TYPE_TEMPERATURE,
                temp
            );


            SendSensor(
                CAN_ID_HUMIDITY,
                SENSOR_TYPE_HUMIDITY,
                hum
            );


            SendSensor(
                CAN_ID_SPEED,
                SENSOR_TYPE_SPEED,
                spd
            );


            SendSensor(
                CAN_ID_BATTERY_VOLTAGE,
                SENSOR_TYPE_BATTERY_VOLTAGE,
                volt
            );


            SendSensor(
                CAN_ID_BATTERY_CURRENT,
                SENSOR_TYPE_BATTERY_CURRENT,
                curr
            );


            /*******************************************************************
             * Ultrasonic measurement
             *******************************************************************/

            distanceCm =
                ReadUltrasonicDistance();


            SendSensor(
                CAN_ID_ULTRASONIC,
                SENSOR_TYPE_ULTRASONIC,
                distanceCm
            );


            /*******************************************************************
             * IR measurement
             *******************************************************************/

            irObstacle =
                GetIRObstacleStatus();


            /*******************************************************************
             * Send IR status over CAN
             *******************************************************************/

