Subiksha-A/QNX_India_Hackathon_CHN_2026_019/src/ecu/mcxa156/frdm_mcxa156_sensor_node.c
            SendIRSensor(
                irObstacle
            );


            /*******************************************************************
             * Convert values for UART display
             *******************************************************************/

            {
                uint32_t temp100;
                uint32_t hum10;
                uint32_t spd10;
                uint32_t volt100;
                uint32_t curr100;
                uint32_t dist100;


                temp100 =
                    (uint32_t)(
                        (temp * 100.0f) + 0.5f
                    );


                hum10 =
                    (uint32_t)(
                        (hum * 10.0f) + 0.5f
                    );


                spd10 =
                    (uint32_t)(
                        (spd * 10.0f) + 0.5f
                    );


                volt100 =
                    (uint32_t)(
                        (volt * 100.0f) + 0.5f
                    );


                curr100 =
                    (uint32_t)(
                        (curr * 100.0f) + 0.5f
                    );


                dist100 =
                    (uint32_t)(
                        (distanceCm * 100.0f) + 0.5f
                    );


                /****************************************************************
                 * Valid ultrasonic measurement
                 ****************************************************************/

                if (distanceCm > 0.0f)
                {
                    LOG_INFO((
                        "[Node %d #%u] "
                        "Temp: %lu.%02lu C | "
                        "Hum: %lu.%01lu %% | "
                        "Spd: %lu.%01lu km/h | "
                        "V: %lu.%02lu V | "
                        "I: %lu.%02lu A | "
                        "Distance: %lu.%02lu cm | "
                        "IR: %s\r\n",

                        THIS_NODE_ID,

                        cycle,

                        (unsigned long)
                            (temp100 / 100U),

                        (unsigned long)
                            (temp100 % 100U),

                        (unsigned long)
                            (hum10 / 10U),

                        (unsigned long)
                            (hum10 % 10U),

                        (unsigned long)
                            (spd10 / 10U),

                        (unsigned long)
                            (spd10 % 10U),

                        (unsigned long)
                            (volt100 / 100U),

                        (unsigned long)
                            (volt100 % 100U),

                        (unsigned long)
                            (curr100 / 100U),

                        (unsigned long)
                            (curr100 % 100U),

                        (unsigned long)
                            (dist100 / 100U),

                        (unsigned long)
                            (dist100 % 100U),

                        irObstacle
                            ? "OBSTACLE"
                            : "CLEAR"
                    ));
                }


                /****************************************************************
                 * Ultrasonic timeout
                 ****************************************************************/

                else
                {
                    LOG_INFO((
                        "[Node %d #%u] "
                        "Temp: %lu.%02lu C | "
                        "Hum: %lu.%01lu %% | "
                        "Spd: %lu.%01lu km/h | "
                        "V: %lu.%02lu V | "
                        "I: %lu.%02lu A | "
                        "Distance: TIMEOUT | "
                        "IR: %s\r\n",

                        THIS_NODE_ID,

                        cycle,

                        (unsigned long)
                            (temp100 / 100U),

                        (unsigned long)
                            (temp100 % 100U),

                        (unsigned long)
                            (hum10 / 10U),

                        (unsigned long)
                            (hum10 % 10U),

                        (unsigned long)
                            (spd10 / 10U),

                        (unsigned long)
                            (spd10 % 10U),

                        (unsigned long)
                            (volt100 / 100U),

                        (unsigned long)
                            (volt100 % 100U),

                        (unsigned long)
                            (curr100 / 100U),

                        (unsigned long)
                            (curr100 % 100U),

                        irObstacle
                            ? "OBSTACLE"
                            : "CLEAR"
                    ));
                }
            }
        }


        /***********************************************************************
         * Non-blocking delay
         *
         * Check QNX commands every 10 ms.
         ***********************************************************************/

        for (
            uint32_t elapsed = 0U;
            elapsed < SENSOR_INTERVAL_MS;
            elapsed += 10U
        )
        {
            CheckIncomingCommands();


            SDK_DelayAtLeastUs(
                10000U,
                SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY
            );
        }
    }
}